# 1. Используем минимальный образ Python 3.11
FROM python:3.11-slim

# 2. Назначаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями
COPY requirements.txt .

# 4. Устанавливаем зависимости (aiogram и всё остальное)
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем остальные файлы проекта внутрь контейнера
COPY . .

# 6. Устанавливаем переменную окружения для логов и буфера
ENV PYTHONUNBUFFERED=1

# 7. Указываем команду, которую выполнять при запуске контейнера
CMD ["python", "bot.py"]
